; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v3 - type_1 ?v2 - type_2)
 	      (pred_3 ?v8 - object ?v2 - type_2)
	      (pred_4 ?v3 - type_1 ?v5 - type_3)
	      (pred_1 ?v3 - type_1 ?v8 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v6 ?v4 - type_2)
       :precondition (and  (pred_2 ?v3 ?v6))
       :effect (and  (pred_2 ?v3 ?v4)
		     (not (pred_2 ?v3 ?v6))))

   (:action op_1
       :parameters (?v3 - type_1 ?v7 - object ?v1 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_2 ?v3 ?v1) (pred_4 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_1 ?v7 - object ?v1 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v7 ?v5) (pred_2 ?v3 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_4 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v7 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_1
obj_11 obj_08 obj_09 obj_03 - type_3
obj_04 obj_06 obj_12 - type_2
obj_05 obj_10 obj_02 - object)
(:init
(pred_2 obj_07 obj_06)
(pred_4 obj_07 obj_11)
(pred_4 obj_07 obj_08)
(pred_2 obj_01 obj_04)
(pred_4 obj_01 obj_09)
(pred_4 obj_01 obj_03)
(pred_3 obj_05 obj_04)
(pred_3 obj_10 obj_12)
(pred_3 obj_02 obj_12)
)
(:goal
(and
(pred_3 obj_05 obj_12)
(pred_3 obj_10 obj_12)
(pred_3 obj_02 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_12)))
)
)

; plan
1. (op_1 obj_01 obj_05 obj_04 obj_03)
   deleted: (pred_3 obj_05 obj_04) (pred_4 obj_01 obj_03)
   added: (pred_1 obj_01 obj_05 obj_03)
   goals met: 1 of 3
2. (op_2 obj_01 obj_04 obj_12)
   deleted: (pred_2 obj_01 obj_04)
   added: (pred_2 obj_01 obj_12)
   goals met: 1 of 3
3. (op_3 obj_01 obj_05 obj_12 obj_03)
   deleted: (pred_1 obj_01 obj_05 obj_03)
   added: (pred_3 obj_05 obj_12) (pred_4 obj_01 obj_03)
   goals met: 2 of 3
4. (op_1 obj_01 obj_02 obj_12 obj_03)
   deleted: (pred_3 obj_02 obj_12) (pred_4 obj_01 obj_03)
   added: (pred_1 obj_01 obj_02 obj_03)
   goals met: 2 of 3
5. (op_2 obj_01 obj_12 obj_06)
   deleted: (pred_2 obj_01 obj_12)
   added: (pred_2 obj_01 obj_06)
   goals met: 2 of 3
6. (op_3 obj_01 obj_02 obj_06 obj_03)
   deleted: (pred_1 obj_01 obj_02 obj_03)
   added: (pred_3 obj_02 obj_06) (pred_4 obj_01 obj_03)
   goals met: 3 of 3
